app/views/tickets/show.html.erb

SELECT "assets".* FROM "assets" WHERE "assets"."ticket_id" = 7
---
	<div class="asset">
		<% @ticket.assets.each do |asset| %>