app/controllers/files_controller.rb

	def show
		asset = Asset.find(params[:id])
---
SELECT "assets".* FROM "assets" WHERE "assets"."id" = ? LIMIT 1  [["id", "4"]]