app/controllers/projects_controller.rb

	def create
		@project = Project.new(params[:project])

		if @project.save
---
INSERT INTO "projects" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Sun, 25 Sep 2011 00:16:58 UTC +00:00], ["name", "test"], ["updated_at", Sun, 25 Sep 2011 00:16:58 UTC +00:00]]

	def update
		@project = Project.find(params[:id])

		if @project.update_attributes(params[:project])
---
SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", "11"]]
UPDATE "projects" SET "name" = 'TextMate 2 beta', "updated_at" = '2011-10-01 20:38:22.730467' WHERE "projects"."id" = 11