app/controllers/tickets_controller.rb

INSERT INTO "tickets" ("created_at", "description", "project_id", "title", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Sun, 02 Oct 2011 05:11:03 UTC +00:00], ["description", "kkekeke"], ["project_id", 1], ["title", "Penis?"], ["updated_at", Sun, 02 Oct 2011 05:11:03 UTC +00:00]]
---
	def create
		@ticket = @project.tickets.build(params[:ticket])
		@ticket = @project.tickets.build(params[:ticket].merge!(:user => current_user))
		if @ticket.save

UPDATE "tickets" SET "description" = 'We need to fix this flight schedule asap to get visitors to stop bitching. lol', "updated_at" = '2011-10-17 02:27:29.396233' WHERE "tickets"."id" = 6
---
	def update
		if @ticket.update_attributes(params[:ticket])

DELETE FROM "tickets" WHERE "tickets"."id" = ?  [["id", 8]]
---
	def destroy
		@ticket.destroy

SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", "15"]]
---
		def find_project
			@project = Project.find(params[:project_id])

SELECT "tickets".* FROM "tickets" WHERE "tickets"."project_id" = 15 AND "tickets"."id" = ? LIMIT 1  [["id", "8"]]
---
	def find_ticket
		@ticket = @project.tickets.find(params[:id])